In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
categories = pd.read_csv('data/item_categories.csv')
items = pd.read_csv('data/items.csv')
shops = pd.read_csv('data/shops.csv')
sales = pd.read_csv('data/sales_train.csv')
test_data = pd.read_csv('data/test.csv')

In [4]:
test_data

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [5]:
sales

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
0,02.01.2013,0,59,22154,999.00,1.0
1,03.01.2013,0,25,2552,899.00,1.0
2,05.01.2013,0,25,2552,899.00,-1.0
3,06.01.2013,0,25,2554,1709.05,1.0
4,15.01.2013,0,25,2555,1099.00,1.0
...,...,...,...,...,...,...
2935844,10.10.2015,33,25,7409,299.00,1.0
2935845,09.10.2015,33,25,7460,299.00,1.0
2935846,14.10.2015,33,25,7459,349.00,1.0
2935847,22.10.2015,33,25,7440,299.00,1.0
2935848,03.10.2015,33,25,7460,299.00,1.0

In [6]:
block_store_item_sum = sales.groupby(['date_block_num','shop_id', 'item_id']).item_cnt_day.sum()

In [7]:
shop_item_mean = block_store_item_sum.groupby(level=[1,2]).mean()

In [8]:
shop_item_mean

shop_id  item_id
0        30         31.000000
         31         11.000000
         32          8.000000
         33          3.000000
         35          7.500000
                      ...
59       22154       1.000000
         22155       1.000000
         22162       3.200000
         22164       1.500000
         22167       1.333333
Name: item_cnt_day, Length: 424124, dtype: float64

In [9]:
test_data

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [28]:
merged = pd.merge(test_data, shop_item_mean.reset_index(), how='left').fillna(0.5)

In [29]:
merged.shape

(214200, 4)

In [30]:
base_pred = merged.rename(columns={'item_cnt_day':'item_cnt_month'}).set_index('ID').item_cnt_month

In [31]:
base_pred.to_csv('base_pred.csv')

In [32]:
!head -n 10 base_pred.csv

ID,item_cnt_month
0,1.4444444444444444
1,0.5
2,2.0
3,1.0
4,0.5
5,1.8333333333333333
6,2.5
7,2.0
8,5.7272727272727275

In [33]:
!wc -l base_pred.csv

214201 base_pred.csv

In [ ]:
# 1.23646